app/controllers/tasks_controller.rb

  def index
    @tasks = current_user.tasks.order("expiry").all
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 ORDER BY expiry  [["user_id", nil]]

  def create
    current_user.tasks.create( task_create_params)
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "expiry", "importance") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "paint"], ["description", "web version"], ["created_at", "2017-12-02 20:56:33.511258"], ["updated_at", "2017-12-02 20:56:33.511258"], ["expiry", "2017-12-02 00:00:00"], ["importance", 5]]